{
  "mining_setup": "There are no entities on the map",
  "objectives": [
                {"objective": "We require one OffshorePump. The final success should be checked by looking if a OffshorePump is in inventory",
                "inventory": {},
                "name": "craft_offshore_pump"},
                {"objective": "We require one Boiler. The final success should be checked by looking if a Boiler is in inventory",
                "inventory": {},
                "name": "craft_boiler"},
                {"objective": "We require one SteamEngine. The final success should be checked by looking if a SteamEngine is in inventory",
                "inventory": {},
                "name": "craft_steam_engine"},
                {"objective": "We require one Lab. The final success should be checked by looking if a Lab is in inventory",
                "inventory": {},
                "name": "craft_lab"},
                {"objective": "We require one GunTurret. The final success should be checked by looking if a GunTurret is in inventory",
                "inventory": {},
                "name": "craft_gun_turret"},
                {"objective": "We require one Radar. The final success should be checked by looking if a Radar is in inventory",
                "inventory": {},
                "name": "craft_radar"},
                {"objective": "We require one AssemblingMachine. The final success should be checked by looking if a AssemblingMachine is in inventory",
                "inventory": {},
                "name": "craft_assembling_machine"},
                {"objective": "We require one BurnerInserter. The final success should be checked by looking if a BurnerInserter is in inventory",
                "inventory": {},
                "name": "craft_burner_inserter"},
                {"objective": "We require one BurnerMiningDrill. The final success should be checked by looking if a BurnerMiningDrill is in inventory",
                "inventory": {},
                "name": "craft_burner_mining_drill"},
                {"objective": "We require one ElectricMiningDrill. The final success should be checked by looking if a ElectricMiningDrill is in inventory",
                "inventory": {},
                "name": "craft_electric_mining_drill"}
  ]
}