{
  "objectives": [
                {"objective": "Craft 1 stone furnace. The final success should be checked by looking if the stone furnace is in inventory",
                "name": "craft_1_stone_furnace"},
                {"objective": "Craft 3 stone furnaces. The final success should be checked by looking if 3 stone furnaces are in inventory",
                "name": "craft_3_stone_furnace"},
                {"objective": "Smelt 10 copper plates. The final success should be checked by looking if the copper plates are in inventory",
                "name": "smelt_10_copper_plates"},
                {"objective": "Smelt 20 iron plates. The final success should be checked by looking if the iron plates are in inventory",
                "name": "smelt_20_iron_plates"},
                {"objective": "Craft 5 iron gear wheels. The final success should be checked by looking if 5 gear wheels are in inventory",
                "name": "craft_5_iron_gear_wheels"},
                {"objective": "Craft 10 transport belts. The final success should be checked by looking if 10 transport belts are in inventory",
                "name": "craft_10_transport_belts"},
                {"objective": "Craft 10 copper cables. The final success should be checked by looking if 10 copper cables are in inventory",
                "name": "craft_10_copper_cables"},
                {"objective": "Craft 20 electronic circuits. The final success should be checked by looking if 10 electronic circuits are in inventory",
                "name": "craft_20_electronic_circuits"},
                {"objective": "Craft 10 small electric poles. The final success should be checked by looking if 10 small electric poles are in inventory",
                "name": "craft_10_small_electric_poles"},
                {"objective": "Craft 20 automation science packs. The final success should be checked by looking if 20 automation science packs are in inventory",
                "name": "craft_20_automation_packs"},
                {"objective": "Craft 20 firearm magazines. The final success should be checked by looking if 20 firearm magazines are in inventory",
                "name": "craft_20_firearm_magazines"},
                {"objective": "Craft 20 stone bricks. The final success should be checked by looking if 20 stone bricks are in inventory",
                "name": "craft_20_stone_bricks"}
  ]
}