{
    "mining_setup": "There are no entities on the map",
    "objectives": [
                  {"objective": "We need to use a assembling machine to automatically craft iron gear wheels. The final setup should be checked by looking if the assembling machine has iron gear wheels",
                  "inventory": {
                              "iron-plate": 10
                          },
                  "name": "assembling_machine_iron"},
                  {"objective": "We need to use a assembling machine to automatically craft copper cables. The final setup should be checked by looking if the assembling machine has copper cables",
                  "inventory": {
                              "copper-plate": 100
                          },
                  "name": "assembling_machine_copper"},
                  {"objective": "We need to use a assembling machine to automatically craft electronic circuits. The final setup should be checked by looking if the assembling machine has electronic circuits",
                  "inventory": {
                              "iron-plate": 10,
                              "copper-plate": 10
                          },
                  "name": "assembling_machine_electronic_circuit"},
                  {"objective": "We need to use a assembling machine to automatically craft iron gear wheels with plates that are put to the machine from a chest with inserter. The final setup should be checked by looking if the assembling machine has iron gear wheels",
                  "inventory": {
                              "iron-plate": 10,
                              "wooden-chest": 1,
                              "burner-inserter": 1,
                              "coal": 5
                          },
                  "name": "assembling_machine_iron_from_chest"},
                  {"objective": "We need to use a assembling machine to automatically craft copper cables that will be put to a chest next to it using an inserter. The final setup should be checked by looking if the chest has copper cables in it",
                  "inventory": {
                              "copper-plate": 1000,
                              "wooden-chest": 1,
                              "burner-inserter": 1,
                              "coal": 5
                          },
                  "name": "assembling_machine_copper_to_chest"},
                  {"objective": "We need to use a assembling machine to automatically craft copper cables that will be put to a chest next to it using an inserter. The copper plates also need to come from a chest with copper plates using an inserter.  The final setup should be checked by looking if the chest has copper cables in it",
                  "inventory": {
                              "copper-plate": 1000,
                              "wooden-chest": 1,
                              "burner-inserter": 2,
                              "coal": 10
                          },
                  "name": "assembling_machine_copper_double_chest"}
    ]
  }